---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.SiteInvisible
source: html/6c8f53e0-d0e4-2932-0a40-03b1b751100f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.SiteInvisible Property

Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics.

## Syntax (C#)
```csharp
public static FailureDefinitionId SiteInvisible { get; }
```